{
  "backend/main.mo": "Motoko canister storing player profiles with settings and best scores, supporting save, update, read, and admin-only full export.",
  "feature_evidence.json": "Feature evidence report mapping features to impacted files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing concise summaries of all frontend source files.",
  "frontend/index.css": "Global Tailwind CSS variables and dark mode theme definitions for the app.",
  "frontend/index.html": "Base HTML entry point loading the React app.",
  "frontend/src/App.tsx": "App root wrapping GameScreen in a dark-mode ThemeProvider.",
  "frontend/src/game/abilities/useShieldAbility.ts": "Zustand-based shield ability store enabling shield deployment with cooldowns.",
  "frontend/src/game/aim/AimAssistSystem.ts": "Aim assist class nudging aim toward visible enemy hit zones via raycasting.",
  "frontend/src/game/audio/AudioManager.ts": "Audio manager for gunshot and headshot sounds respecting user volume settings.",
  "frontend/src/game/bots/BotCharacter.tsx": "AI bot that moves in a pattern, casts rays to shoot the player, and exposes invisible hit zones for damage detection.",
  "frontend/src/game/bots/BotManager.tsx": "Spawns three BotCharacter instances at preset positions.",
  "frontend/src/game/camera/ThirdPersonCameraRig.tsx": "Smoothly follows the player and adjusts FOV based on ADS state.",
  "frontend/src/game/combat/hitDetection.ts": "Performs a center-screen raycast to detect hits on head or body and awards score.",
  "frontend/src/game/combat/RecoilSystem.ts": "Handles recoil accumulation and decay, returning vertical and horizontal offsets per shot.",
  "frontend/src/game/combat/useWeaponSystem.ts": "Runs firing logic, recoil application, ammo updates, audio, and hit detection each frame.",
  "frontend/src/game/controls/useDesktopControls.ts": "Maps keyboard and mouse input to movement, firing, ADS, jumping, crouching, and weapon actions.",
  "frontend/src/game/controls/useMobileControls.ts": "Placeholder hook for future mobile control logic.",
  "frontend/src/game/GameCanvas.tsx": "R3F canvas with physics, player, bots, camera rig, lighting, and shield manager.",
  "frontend/src/game/GameScreen.tsx": "Initializes player profile and settings before rendering the game canvas and HUD.",
  "frontend/src/game/player/PlayerController.tsx": "Handles player physics, movement, jumping, and syncing player model position/rotation.",
  "frontend/src/game/postfx/PostProcessing.tsx": "Stub component where post-processing can be re-enabled later.",
  "frontend/src/game/state/gameStore.ts": "Zustand store managing player state, combat data, weapons, health, score, and actions.",
  "frontend/src/game/state/qualityStore.ts": "Zustand store for graphics quality presets and shadow/pixel ratio settings.",
  "frontend/src/game/state/settingsStore.ts": "Zustand settings store for sensitivity, audio, and quality preferences, with update helpers.",
  "frontend/src/game/vfx/MuzzleFlash.tsx": "Placeholder component for weapon muzzle flash effects.",
  "frontend/src/game/world/ArenaMap.tsx": "Defines ground plane and several static cover boxes with physics bodies.",
  "frontend/src/game/world/LightingRig.tsx": "Sets up ambient, directional, and hemisphere lighting with optional shadows.",
  "frontend/src/game/world/ShieldWall.tsx": "Creates a static translucent shield wall physics object at a given position and rotation.",
  "frontend/src/game/world/ShieldWallManager.tsx": "Renders active shields and updates their cooldown each frame.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines player-related queries and mutations using the actor to load profiles, save settings, and update scores.",
  "frontend/src/hud/controls/ActionButtons.tsx": "Renders touch‑based action buttons for firing, ADS, movement, weapon cycling, reload, and shield activation.",
  "frontend/src/hud/controls/SettingsButton.tsx": "Displays a button that opens the settings panel overlay.",
  "frontend/src/hud/controls/ShieldButton.tsx": "Button for deploying the shield ability with cooldown visualization and disabled state handling.",
  "frontend/src/hud/controls/VirtualStick.tsx": "Implements a touch‑controlled virtual joystick that updates player movement based on touch position.",
  "frontend/src/hud/HUD.tsx": "Composes the full HUD layout by rendering health, ammo, score, minimap, crosshair, and control widgets.",
  "frontend/src/hud/layout/HUDLayout.tsx": "Provides a fixed overlay layout container for HUD elements.",
  "frontend/src/hud/widgets/AmmoCounter.tsx": "Shows current weapon ammo, name, and reload state.",
  "frontend/src/hud/widgets/Crosshair.tsx": "Displays a dynamic crosshair that changes size when ADS is active.",
  "frontend/src/hud/widgets/HealthBar.tsx": "Renders the player's health bar and numeric values.",
  "frontend/src/hud/widgets/MiniMap.tsx": "Displays a minimap frame with a player orientation indicator.",
  "frontend/src/hud/widgets/ScorePanel.tsx": "Shows the player's score and headshot count in a compact panel.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, and global styles including body, canvas, and range input styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/persistence/playerProfileRepo.ts": "Manages loading, saving, and clearing player profiles in localStorage.",
  "frontend/src/persistence/usePlayerProfile.ts": "React hook that syncs player profile, settings, and best scores between backend, game state, and local storage.",
  "frontend/src/ui/AuthControls.tsx": "UI component for login/logout using Internet Identity with loading state and error handling.",
  "frontend/src/ui/SettingsPanel.tsx": "Displays settings UI including best records, aim options, audio, and quality settings with close controls.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, typography, and theme settings based on CSS variables.",
  "project_state.json": "Defines project metadata, high-level goals, architectural notes, and a list of implemented gameplay features for a 3D third‑person shooter. Includes versioning info, target platforms, and detailed feature entries for movement, shooting, bots, and environment."
}